In [ ]:
import pandas as pd
import numpy as np

C:\Users\Harsh\anaconda3\Lib\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [2]:
data = pd.read_csv("Diwali Sales Data.csv", encoding ="latin1")

In [3]:
data.head(5)

,User_ID,Cust_name,Product_ID,Gender,Age Group,Age,Marital_Status,State,Zone,Occupation,Product_Category,Orders,Amount,Status,unnamed1
0,1002903,Sanskriti,P00125942,F,26-35,28,0,Maharashtra,Western,Healthcare,Auto,1,23952.0,NaN,NaN
1,1000732,Kartik,P00110942,F,26-35,35,1,Andhra Pradesh,Southern,Govt,Auto,3,23934.0,NaN,NaN
2,1001990,Bindu,P00118542,F,26-35,35,1,Uttar Pradesh,Central,Automobile,Auto,3,23924.0,NaN,NaN
3,1001425,Sudevi,P00237842,M,0-17,16,0,Karnataka,Southern,Construction,Auto,2,23912.0,NaN,NaN
4,1000588,Joni,P00057942,M,26-35,28,1,Gujarat,Western,Food Processing,Auto,2,23877.0,NaN,NaN

In [4]:
data.isnull().sum()

User_ID                 0
Cust_name               0
Product_ID              0
Gender                  0
Age Group               0
Age                     0
Marital_Status          0
State                   0
Zone                    0
Occupation              0
Product_Category        0
Orders                  0
Amount                 12
Status              11251
unnamed1            11251
dtype: int64

In [5]:
data.drop(columns=['Status','unnamed1'],inplace = True)

In [6]:
data = data.dropna(subset=['Amount'])

In [7]:
data

,User_ID,Cust_name,Product_ID,Gender,Age Group,Age,Marital_Status,State,Zone,Occupation,Product_Category,Orders,Amount
0,1002903,Sanskriti,P00125942,F,26-35,28,0,Maharashtra,Western,Healthcare,Auto,1,23952.0
1,1000732,Kartik,P00110942,F,26-35,35,1,Andhra Pradesh,Southern,Govt,Auto,3,23934.0
2,1001990,Bindu,P00118542,F,26-35,35,1,Uttar Pradesh,Central,Automobile,Auto,3,23924.0
3,1001425,Sudevi,P00237842,M,0-17,16,0,Karnataka,Southern,Construction,Auto,2,23912.0
4,1000588,Joni,P00057942,M,26-35,28,1,Gujarat,Western,Food Processing,Auto,2,23877.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
11246,1000695,Manning,P00296942,M,18-25,19,1,Maharashtra,Western,Chemical,Office,4,370.0
11247,1004089,Reichenbach,P00171342,M,26-35,33,0,Haryana,Northern,Healthcare,Veterinary,3,367.0
11248,1001209,Oshin,P00201342,F,36-45,40,0,Madhya Pradesh,Central,Textile,Office,4,213.0
11249,1004023,Noonan,P00059442,M,36-45,37,0,Karnataka,Southern,Agriculture,Office,3,206.0
11250,1002744,Brumley,P00281742,F,18-25,19,0,Maharashtra,Western,Healthcare,Office,3,188.0

In [8]:
# we have no longer use of user_id, cust_name, Prodect_id
data = data.drop(columns=['User_ID','Cust_name','Product_ID'])

In [9]:
data = data.drop(columns=['Marital_Status'])# also Marital_Status no use

In [10]:
data = data.drop(columns=['Age'])

In [11]:
data

,Gender,Age Group,State,Zone,Occupation,Product_Category,Orders,Amount
0,F,26-35,Maharashtra,Western,Healthcare,Auto,1,23952.0
1,F,26-35,Andhra Pradesh,Southern,Govt,Auto,3,23934.0
2,F,26-35,Uttar Pradesh,Central,Automobile,Auto,3,23924.0
3,M,0-17,Karnataka,Southern,Construction,Auto,2,23912.0
4,M,26-35,Gujarat,Western,Food Processing,Auto,2,23877.0
...,...,...,...,...,...,...,...,...
11246,M,18-25,Maharashtra,Western,Chemical,Office,4,370.0
11247,M,26-35,Haryana,Northern,Healthcare,Veterinary,3,367.0
11248,F,36-45,Madhya Pradesh,Central,Textile,Office,4,213.0
11249,M,36-45,Karnataka,Southern,Agriculture,Office,3,206.0
11250,F,18-25,Maharashtra,Western,Healthcare,Office,3,188.0

In [12]:
for column in data.columns:
    print(data[column].value_counts())
    print("*"*20)

Gender
F    7832
M    3407
Name: count, dtype: int64
********************
Age Group
26-35    4541
36-45    2283
18-25    1879
46-50     983
51-55     830
55+       427
0-17      296
Name: count, dtype: int64
********************
State
Uttar Pradesh       1944
Maharashtra         1525
Karnataka           1304
Delhi               1104
Madhya Pradesh       921
Andhra Pradesh       811
Himachal Pradesh     608
Kerala               453
Haryana              452
Bihar                434
Gujarat              427
Jharkhand            380
Uttarakhand          320
Rajasthan            231
Punjab               200
Telangana            125
Name: count, dtype: int64
********************
Zone
Central     4289
Southern    2693
Western     1952
Northern    1491
Eastern      814
Name: count, dtype: int64
********************
Occupation
IT Sector          1583
Healthcare         1408
Aviation           1310
Banking            1137
Govt                854
Hospitality         703
Media               637
Automobile          565
Chemical            541
Lawyer              531
Retail              501
Food Processing     423
Construction        414
Textile             349
Agriculture         283
Name: count, dtype: int64
********************
Product_Category
Clothing & Apparel       2655
Food                     2490
Electronics & Gadgets    2087
Footwear & Shoes         1059
Household items           520
Beauty                    422
Games & Toys              386
Sports Products           356
Furniture                 352
Pet Care                  212
Office                    113
Stationery                112
Books                     103
Auto                       97
Decor                      96
Veterinary                 81
Tupperware                 72
Hand & Power Tools         26
Name: count, dtype: int64
********************
Orders
2    2893
1    2808
4    2773
3    2765
Name: count, dtype: int64
********************
Amount
7907.0     11
7956.0     10
7086.0      9
6923.0      8
7037.0      8
           ..
12078.0     1
12079.0     1
12082.0     1
12083.0     1
188.0       1
Name: count, Length: 6584, dtype: int64
********************

# apply OneHotEncoding on Zone Column

In [13]:
from sklearn.preprocessing import OneHotEncoder

In [14]:
one = OneHotEncoder()

In [15]:
encoded = one.fit_transform(data[['Zone']]).toarray()

In [16]:
df = pd.DataFrame(encoded, columns=one.get_feature_names_out(['Zone']))

In [17]:
df

       Zone_Central  Zone_Eastern  Zone_Northern  Zone_Southern  Zone_Western
0               0.0           0.0            0.0            0.0           1.0
1               0.0           0.0            0.0            1.0           0.0
2               1.0           0.0            0.0            0.0           0.0
3               0.0           0.0            0.0            1.0           0.0
4               0.0           0.0            0.0            0.0           1.0
...             ...           ...            ...            ...           ...
11234           0.0           0.0            0.0            0.0           1.0
11235           0.0           0.0            1.0            0.0           0.0
11236           1.0           0.0            0.0            0.0           0.0
11237           0.0           0.0            0.0            1.0           0.0
11238           0.0           0.0            0.0            0.0           1.0

[11239 rows x 5 columns]

In [18]:
data=pd.concat([data,df],axis=1)

In [19]:
data.head(2)

,Gender,Age Group,State,Zone,Occupation,Product_Category,Orders,Amount,Zone_Central,Zone_Eastern,Zone_Northern,Zone_Southern,Zone_Western
0,F,26-35,Maharashtra,Western,Healthcare,Auto,1.0,23952.0,0.0,0.0,0.0,0.0,1.0
1,F,26-35,Andhra Pradesh,Southern,Govt,Auto,3.0,23934.0,0.0,0.0,0.0,1.0,0.0

In [20]:
# We working Zones Not in state data so 
data.drop(columns =['State','Zone'],inplace = True)

In [21]:
data.head(5)

,Gender,Age Group,Occupation,Product_Category,Orders,Amount,Zone_Central,Zone_Eastern,Zone_Northern,Zone_Southern,Zone_Western
0,F,26-35,Healthcare,Auto,1.0,23952.0,0.0,0.0,0.0,0.0,1.0
1,F,26-35,Govt,Auto,3.0,23934.0,0.0,0.0,0.0,1.0,0.0
2,F,26-35,Automobile,Auto,3.0,23924.0,1.0,0.0,0.0,0.0,0.0
3,M,0-17,Construction,Auto,2.0,23912.0,0.0,0.0,0.0,1.0,0.0
4,M,26-35,Food Processing,Auto,2.0,23877.0,0.0,0.0,0.0,0.0,1.0

# Label Encoding on Occupation

In [22]:
data['Occupation'] = data['Occupation'].str.strip()
Occ_count = data['Occupation'].value_counts()

In [23]:
Occ_count

Occupation
IT Sector          1583
Healthcare         1408
Aviation           1310
Banking            1137
Govt                854
Hospitality         703
Media               637
Automobile          565
Chemical            541
Lawyer              531
Retail              501
Food Processing     423
Construction        414
Textile             349
Agriculture         283
Name: count, dtype: int64

In [24]:
less_500 = Occ_count[Occ_count<=500]
less_500

Occupation
Food Processing    423
Construction       414
Textile            349
Agriculture        283
Name: count, dtype: int64

In [25]:
data['Occupation']=data['Occupation'].apply(lambda x: "other" if x in less_500 else x)

In [26]:
data['Occupation'].value_counts()

Occupation
IT Sector      1583
other          1469
Healthcare     1408
Aviation       1310
Banking        1137
Govt            854
Hospitality     703
Media           637
Automobile      565
Chemical        541
Lawyer          531
Retail          501
Name: count, dtype: int64

In [27]:
from sklearn.preprocessing import LabelEncoder

In [28]:
le = LabelEncoder()

In [29]:
data['Occ_encod'] = le.fit_transform(data['Occupation'])

In [32]:
data['Prod_encode']= le.fit_transform(data['Product_Category'])

In [33]:
data.head(5)

,Gender,Age Group,Occupation,Product_Category,Orders,Amount,Zone_Central,Zone_Eastern,Zone_Northern,Zone_Southern,Zone_Western,Occ_encod,Prod_encode
0,F,26-35,Healthcare,Auto,1.0,23952.0,0.0,0.0,0.0,0.0,1.0,5,0
1,F,26-35,Govt,Auto,3.0,23934.0,0.0,0.0,0.0,1.0,0.0,4,0
2,F,26-35,Automobile,Auto,3.0,23924.0,1.0,0.0,0.0,0.0,0.0,0,0
3,M,0-17,other,Auto,2.0,23912.0,0.0,0.0,0.0,1.0,0.0,11,0
4,M,26-35,other,Auto,2.0,23877.0,0.0,0.0,0.0,0.0,1.0,11,0

In [34]:
data.drop(columns = ['Occupation','Product_Category'],inplace =True)

In [35]:
data.head(5)

,Gender,Age Group,Orders,Amount,Zone_Central,Zone_Eastern,Zone_Northern,Zone_Southern,Zone_Western,Occ_encod,Prod_encode
0,F,26-35,1.0,23952.0,0.0,0.0,0.0,0.0,1.0,5,0
1,F,26-35,3.0,23934.0,0.0,0.0,0.0,1.0,0.0,4,0
2,F,26-35,3.0,23924.0,1.0,0.0,0.0,0.0,0.0,0,0
3,M,0-17,2.0,23912.0,0.0,0.0,0.0,1.0,0.0,11,0
4,M,26-35,2.0,23877.0,0.0,0.0,0.0,0.0,1.0,11,0